Autodesk.Revit.DB.IFC.IFCAggregate.CreateValueOfType(System.String)
Creates an ifc object with primitive type of aggregate's item type.
This method is deprecated in Revit 2023 and may be removed in a later version of Revit.
In Revit 2023 use addValueOfType instead.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The aggregate is not valid.
Since:
2022.1